import React from "react";
import {
  InfoCircleFilled,
  WarningFilled,
  RobotFilled,
} from "@ant-design/icons/lib/icons";

export enum Stage {
  NotReady = "准备",
  Unable = "禁止",
  DesignBrief = "设计摘要的环境",
  Sketch = "草图的环境",
  ModelImage = "模型图的环境",
  Rendering = "场景与产品渲染图的环境",
  Finish = "完成",
}

export enum UserStage {
  DesignBrief = "设计摘要的环境",
  Sketch = "草图的环境",
  ModelImage = "模型图的环境",
  Rendering = "场景与产品渲染图的环境",
}

export enum AIStage {
  DesignBrief = "设计摘要的辅助生成",
  Sketch = "草图的辅助生成",
  ModelImage = "模型图的辅助生成",
  Rendering = "场景与产品渲染图的辅助生成",
}

export const AIStageToStageMapping = {
  [AIStage.DesignBrief]: Stage.DesignBrief,
  [AIStage.Sketch]: Stage.Sketch,
  [AIStage.ModelImage]: Stage.ModelImage,
  [AIStage.Rendering]: Stage.Rendering,
};

// 定义 Stage 和 AIStage 计时记录的状态类型
export type StageSwitchRecord = {
  startTime: number;
  duration?: number;
};

export type StageSwitchRecords = {
  [key in Stage]?: StageSwitchRecord[];
};

export type AIStageSwitchRecords = {
  [key in AIStage]?: StageSwitchRecord[];
};


export const AlertSetting = {
  [Stage.NotReady]: {
    icon: <WarningFilled style={{ color: "#FCC400", fontSize: "20px" }} />,
    message: "请先在左侧输入基本信息，并点击“完成”。",
  },
  [Stage.DesignBrief]: {
    icon: <InfoCircleFilled style={{ color: "var(--DB-color)", fontSize: "20px" }} />,
    message: (
      <span>
        你正在<span style={{ color: "var(--DB-color)" }}>‘{Stage.DesignBrief}’</span>
        中工作。
        <br />
        你可以撰写
        <span style={{ color: "var(--DB-color)" }}>
          目标人群、使用场景、痛点、主要功能
        </span>
        及其他相关内容的文本。
      </span>
    ),
  },
  [Stage.Sketch]: {
    icon: <InfoCircleFilled style={{ color: "var(--S-color)", fontSize: "20px" }} />,
    message: (
      <span>
        你正在<span style={{ color: "var(--S-color)" }}>‘{Stage.Sketch}’</span>中工作。
        <br />
        你可以使用<span style={{ color: "var(--S-color)" }}>黑色画笔</span>
        对设计概念进行初步、粗略的视觉设计表示。
      </span>
    ),
  },
  [Stage.ModelImage]: {
    icon: <InfoCircleFilled style={{ color: "var(--MI-color)", fontSize: "20px" }} />,
    message: (
      <span>
        你正在<span style={{ color: "var(--MI-color)" }}>‘{Stage.ModelImage}’</span>
        中工作。
        <br />
        你可以复制并修改「AI灵感助手」中生成的
        <span style={{ color: "var(--MI-color)" }}>模型图</span>。
      </span>
    ),
  },
  [Stage.Rendering]: {
    icon: <InfoCircleFilled style={{ color: "var(--R-color)", fontSize: "20px" }} />,
    message: (
      <span>
        你正在<span style={{ color: "var(--R-color)" }}>‘{Stage.Rendering}’</span>
        中工作。
        <br />
        你可以复制并修改「AI灵感助手」中生成的
        <span style={{ color: "var(--R-color)" }}>产品与场景渲染图</span>。
      </span>
    ),
  },
};

export const AIAlertSetting = {
  [AIStage.DesignBrief]: {
    icon: <RobotFilled style={{ color: "var(--DB-color)", fontSize: "20px" }} />,
    message: (
      <span>
        <span style={{ color: "var(--DB-color)" }}>AI灵感助手：</span>
        试试这些功能吧！助手提供的文本或图可被复制至工作区～
      </span>
    ),
  },
  [AIStage.Sketch]: {
    icon: <RobotFilled style={{ color: "var(--S-color)", fontSize: "20px" }} />,
    message: (
      <span>
        <span style={{ color: "var(--S-color)" }}>AI灵感助手：</span>
        试试这些功能吧！助手提供的文本或图可被复制至工作区～
      </span>
    ),
  },
  [AIStage.ModelImage]: {
    icon: <RobotFilled style={{ color: "var(--MI-color)", fontSize: "20px" }} />,
    message: (
      <span>
        <span style={{ color: "var(--MI-color)" }}>AI灵感助手：</span>
        试试这些功能吧！助手提供的文本或图可被复制至工作区～
      </span>
    ),
  },
  [AIStage.Rendering]: {
    icon: <RobotFilled style={{ color: "var(--R-color)", fontSize: "20px" }} />,
    message: (
      <span>
        <span style={{ color: "var(--R-color)" }}>AI灵感助手：</span>
        试试这些功能吧！助手提供的文本或图可被复制至工作区～
      </span>
    ),
  },
};

export enum CreativeType {
  DesignBrief,
  Sketch,
  ModelImage,
  Rendering,
}

export const designTextInputW = 220;
export const alertDisplayTime = 300000; // ms
export const strokeUpperSize = 20,
  eraseUpperSize = 20;
export const strokeLowerSize = 1,
  eraseLowerSize = 1;
export const strokeDefaultSize = 5,
  eraseDefaultSize = 5;
export const creativeLessLimit = 3,
  creativeInitNumber = 10;
export const convergenceMinimizeSchemeNumber = 3;

export const convergenceSchemeNumber = 3;
export const maxGenInstanceNumber = 6;
export const minCreativeNumber = 3;
export const getGenerateNumber = (schemeNumber: number) => {
  if (schemeNumber === 1) {
    return 3;
  } else if (schemeNumber === 2) {
    return 2;
  } else if (schemeNumber >= 3) {
    return 1;
  } else {
    return 0;
  }
};

export const buttonsConfig = {
  [AIStage.DesignBrief]: [
    {
      id: "createNew",
      text: "生成全新摘要",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--DB-color)" }}>生成全新摘要：</span>
          选择工作区中的
          <span style={{ color: "var(--DB-color)" }}>文本描述（可选）</span>
          ，生成新摘要。
        </span>
      ),
      svgPath:
        "M16.5 0C7.38736 0 0 7.38736 0 16.5C0 25.6132 7.38736 33 16.5 33C25.6132 33 33 25.6132 33 16.5C33 7.38736 25.6132 0 16.5 0ZM16.5 30.97C8.53927 30.97 2.0625 24.4607 2.0625 16.4999C2.0625 8.5392 8.53927 2.06244 16.5 2.06244C24.4607 2.06244 30.9375 8.53923 30.9375 16.4999C30.9375 24.4606 24.4607 30.97 16.5 30.97ZM23.7188 15.4688H17.5312V9.28125C17.5312 8.712 17.0693 8.25 16.5 8.25C15.9307 8.25 15.4688 8.712 15.4688 9.28125V15.4688H9.28125C8.712 15.4688 8.25 15.9307 8.25 16.5C8.25 17.0693 8.712 17.5312 9.28125 17.5312H15.4688V23.7188C15.4688 24.288 15.9307 24.75 16.5 24.75C17.0693 24.75 17.5312 24.288 17.5312 23.7188V17.5312H23.7188C24.288 17.5312 24.75 17.0693 24.75 16.5C24.75 15.9307 24.288 15.4688 23.7188 15.4688Z",
    },
    {
      id: "refine",
      text: "现有产品参考",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--DB-color)" }}>现有产品参考：</span>
          根据设计任务，给出类似产品。
        </span>
      ),
      svgPath:
        "M28.5 30.875H19V28.5H28.5V20.1875H9.5C8.8703 20.1869 8.26658 19.9364 7.82132 19.4912C7.37605 19.0459 7.12563 18.4422 7.125 17.8125V9.5C7.12563 8.8703 7.37605 8.26658 7.82132 7.82132C8.26658 7.37605 8.8703 7.12563 9.5 7.125H21.375V9.5H9.5V17.8125H28.5C29.1297 17.8131 29.7334 18.0636 30.1787 18.5088C30.6239 18.9541 30.8744 19.5578 30.875 20.1875V28.5C30.8744 29.1297 30.6239 29.7334 30.1787 30.1787C29.7334 30.6239 29.1297 30.8744 28.5 30.875Z M4.75 23.75V26.125H10.1959L2.375 33.9459L4.05413 35.625L11.875 27.8041V33.25H14.25V23.75H4.75ZM33.25 14.25H26.125C25.4953 14.2494 24.8916 13.9989 24.4463 13.5537C24.0011 13.1084 23.7506 12.5047 23.75 11.875V4.75C23.7506 4.1203 24.0011 3.51658 24.4463 3.07132C24.8916 2.62605 25.4953 2.37563 26.125 2.375H33.25C33.8797 2.37563 34.4834 2.62605 34.9287 3.07132C35.3739 3.51658 35.6244 4.1203 35.625 4.75V11.875C35.6244 12.5047 35.3739 13.1084 34.9287 13.5537C34.4834 13.9989 33.8797 14.2494 33.25 14.25ZM26.125 4.75V11.875H33.25V4.75H26.125Z",
    },
    {
      id: "extend",
      text: "扩展/增加",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--DB-color)" }}>扩展/增加：</span>
          选择工作区中的
          <span style={{ color: "var(--DB-color)" }}>文本（必选）</span>
          ，扩展或增加功能、技术、造型等内容。
        </span>
      ),
      svgPath:
        "M16.5 28.875H23.7188V30.9375H16.5V28.875ZM16.5 24.75H30.9375V26.8125H16.5V24.75ZM16.5 20.625H30.9375V22.6875H16.5V20.625ZM4.125 20.625V22.6875H8.85431L2.0625 29.4793L3.52069 30.9375L10.3125 24.1457V28.875H12.375V20.625H4.125ZM28.875 8.25H16.5L12.9793 4.72931C12.5926 4.34249 12.0681 4.12512 11.5211 4.125H4.125C3.57799 4.125 3.05339 4.3423 2.66659 4.72909C2.2798 5.11589 2.0625 5.64049 2.0625 6.1875V18.5625H4.125V6.1875H11.5211L15.0418 9.70819L15.6461 10.3125H28.875V18.5625H30.9375V10.3125C30.9375 9.76549 30.7202 9.24089 30.3334 8.85409C29.9466 8.4673 29.422 8.25 28.875 8.25Z",
    },
    {
      id: "transform",
      text: "转化为摘要",
      disabled: true,
      message: <span>试试别的功能吧～</span>,
      svgPath:
        "M25.4995 35.625L20.1256 30.2495L21.2745 29.0811L24.687 32.4319V26.2812H15.3124C14.5649 26.2812 13.9403 26.031 13.4388 25.5305C12.9383 25.0289 12.688 24.4044 12.688 23.6569V14.2806H4.875V12.6556H12.688V6.56837L9.2755 9.91912L8.125 8.74912L13.5005 3.37524L18.8744 8.75074L17.7255 9.91912L14.313 6.56837V23.6569C14.313 23.906 14.417 24.1352 14.625 24.3442C14.833 24.5522 15.0621 24.6562 15.3124 24.6562H34.125V26.2812H26.312V32.4319L29.7245 29.0811L30.875 30.2511L25.4995 35.625ZM24.687 21.4062V15.28C24.687 15.0308 24.583 14.8022 24.375 14.5942C24.167 14.3852 23.9379 14.2806 23.6876 14.2806H17.5614V12.6556H23.6876C24.4351 12.6556 25.0597 12.9064 25.5612 13.408C26.0617 13.9085 26.312 14.533 26.312 15.2816V21.4079L24.687 21.4062Z",
    },
  ],
  [AIStage.Sketch]: [
    {
      id: "createNew",
      text: "生成全新草图",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--S-color)" }}>生成全新草图：</span>
          根据设计任务，生成全新草图。
        </span>
      ),
      svgPath:
        "M16.5 0C7.38736 0 0 7.38736 0 16.5C0 25.6132 7.38736 33 16.5 33C25.6132 33 33 25.6132 33 16.5C33 7.38736 25.6132 0 16.5 0ZM16.5 30.97C8.53927 30.97 2.0625 24.4607 2.0625 16.4999C2.0625 8.5392 8.53927 2.06244 16.5 2.06244C24.4607 2.06244 30.9375 8.53923 30.9375 16.4999C30.9375 24.4606 24.4607 30.97 16.5 30.97ZM23.7188 15.4688H17.5312V9.28125C17.5312 8.712 17.0693 8.25 16.5 8.25C15.9307 8.25 15.4688 8.712 15.4688 9.28125V15.4688H9.28125C8.712 15.4688 8.25 15.9307 8.25 16.5C8.25 17.0693 8.712 17.5312 9.28125 17.5312H15.4688V23.7188C15.4688 24.288 15.9307 24.75 16.5 24.75C17.0693 24.75 17.5312 24.288 17.5312 23.7188V17.5312H23.7188C24.288 17.5312 24.75 17.0693 24.75 16.5C24.75 15.9307 24.288 15.4688 23.7188 15.4688Z",
    },
    {
      id: "refine",
      text: "现有产品参考",
      disabled: false,
      message: (
        <span>
          <span style={{ color:"var(--S-color)" }}>现有产品参考：</span>
          选择工作区中的
          <span style={{ color: "var(--S-color)" }}>功能文本（可选）</span>
          ，提供结构、造型的参考建议。
        </span>
      ),
      svgPath:
        "M28.5 30.875H19V28.5H28.5V20.1875H9.5C8.8703 20.1869 8.26658 19.9364 7.82132 19.4912C7.37605 19.0459 7.12563 18.4422 7.125 17.8125V9.5C7.12563 8.8703 7.37605 8.26658 7.82132 7.82132C8.26658 7.37605 8.8703 7.12563 9.5 7.125H21.375V9.5H9.5V17.8125H28.5C29.1297 17.8131 29.7334 18.0636 30.1787 18.5088C30.6239 18.9541 30.8744 19.5578 30.875 20.1875V28.5C30.8744 29.1297 30.6239 29.7334 30.1787 30.1787C29.7334 30.6239 29.1297 30.8744 28.5 30.875Z M4.75 23.75V26.125H10.1959L2.375 33.9459L4.05413 35.625L11.875 27.8041V33.25H14.25V23.75H4.75ZM33.25 14.25H26.125C25.4953 14.2494 24.8916 13.9989 24.4463 13.5537C24.0011 13.1084 23.7506 12.5047 23.75 11.875V4.75C23.7506 4.1203 24.0011 3.51658 24.4463 3.07132C24.8916 2.62605 25.4953 2.37563 26.125 2.375H33.25C33.8797 2.37563 34.4834 2.62605 34.9287 3.07132C35.3739 3.51658 35.6244 4.1203 35.625 4.75V11.875C35.6244 12.5047 35.3739 13.1084 34.9287 13.5537C34.4834 13.9989 33.8797 14.2494 33.25 14.25ZM26.125 4.75V11.875H33.25V4.75H26.125Z",
    },
    {
      id: "extend",
      text: "扩展/添加",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--S-color)" }}>扩展/增加：</span>
          选择工作区中你的
          <span style={{ color: "var(--S-color)" }}>草图（必选）</span>
          ，增加细节。
        </span>
      ),
      svgPath:
        "M16.5 28.875H23.7188V30.9375H16.5V28.875ZM16.5 24.75H30.9375V26.8125H16.5V24.75ZM16.5 20.625H30.9375V22.6875H16.5V20.625ZM4.125 20.625V22.6875H8.85431L2.0625 29.4793L3.52069 30.9375L10.3125 24.1457V28.875H12.375V20.625H4.125ZM28.875 8.25H16.5L12.9793 4.72931C12.5926 4.34249 12.0681 4.12512 11.5211 4.125H4.125C3.57799 4.125 3.05339 4.3423 2.66659 4.72909C2.2798 5.11589 2.0625 5.64049 2.0625 6.1875V18.5625H4.125V6.1875H11.5211L15.0418 9.70819L15.6461 10.3125H28.875V18.5625H30.9375V10.3125C30.9375 9.76549 30.7202 9.24089 30.3334 8.85409C29.9466 8.4673 29.422 8.25 28.875 8.25Z",
    },
    {
      id: "transform",
      text: "转换为草图",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--S-color)" }}>转换为草图：</span>
          选择工作区中的
          <span style={{ color: "var(--S-color)" }}>文本或图片（必选）</span>
          ，生成产品草图。
        </span>
      ),
      svgPath:
        "M25.4995 35.625L20.1256 30.2495L21.2745 29.0811L24.687 32.4319V26.2812H15.3124C14.5649 26.2812 13.9403 26.031 13.4388 25.5305C12.9383 25.0289 12.688 24.4044 12.688 23.6569V14.2806H4.875V12.6556H12.688V6.56837L9.2755 9.91912L8.125 8.74912L13.5005 3.37524L18.8744 8.75074L17.7255 9.91912L14.313 6.56837V23.6569C14.313 23.906 14.417 24.1352 14.625 24.3442C14.833 24.5522 15.0621 24.6562 15.3124 24.6562H34.125V26.2812H26.312V32.4319L29.7245 29.0811L30.875 30.2511L25.4995 35.625ZM24.687 21.4062V15.28C24.687 15.0308 24.583 14.8022 24.375 14.5942C24.167 14.3852 23.9379 14.2806 23.6876 14.2806H17.5614V12.6556H23.6876C24.4351 12.6556 25.0597 12.9064 25.5612 13.408C26.0617 13.9085 26.312 14.533 26.312 15.2816V21.4079L24.687 21.4062Z",
    },
  ],
  [AIStage.ModelImage]: [
    {
      id: "createNew",
      text: "生成全新模型",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--MI-color)" }}>生成全新模型：</span>
          根据设计任务，生成全新模型图。
        </span>
      ),
      svgPath:
        "M16.5 0C7.38736 0 0 7.38736 0 16.5C0 25.6132 7.38736 33 16.5 33C25.6132 33 33 25.6132 33 16.5C33 7.38736 25.6132 0 16.5 0ZM16.5 30.97C8.53927 30.97 2.0625 24.4607 2.0625 16.4999C2.0625 8.5392 8.53927 2.06244 16.5 2.06244C24.4607 2.06244 30.9375 8.53923 30.9375 16.4999C30.9375 24.4606 24.4607 30.97 16.5 30.97ZM23.7188 15.4688H17.5312V9.28125C17.5312 8.712 17.0693 8.25 16.5 8.25C15.9307 8.25 15.4688 8.712 15.4688 9.28125V15.4688H9.28125C8.712 15.4688 8.25 15.9307 8.25 16.5C8.25 17.0693 8.712 17.5312 9.28125 17.5312H15.4688V23.7188C15.4688 24.288 15.9307 24.75 16.5 24.75C17.0693 24.75 17.5312 24.288 17.5312 23.7188V17.5312H23.7188C24.288 17.5312 24.75 17.0693 24.75 16.5C24.75 15.9307 24.288 15.4688 23.7188 15.4688Z",
    },
    {
      id: "refine",
      text: "现有模型参考",
      disabled: true,
      message: <span>试试别的功能吧～</span>,
      svgPath:
        "M28.5 30.875H19V28.5H28.5V20.1875H9.5C8.8703 20.1869 8.26658 19.9364 7.82132 19.4912C7.37605 19.0459 7.12563 18.4422 7.125 17.8125V9.5C7.12563 8.8703 7.37605 8.26658 7.82132 7.82132C8.26658 7.37605 8.8703 7.12563 9.5 7.125H21.375V9.5H9.5V17.8125H28.5C29.1297 17.8131 29.7334 18.0636 30.1787 18.5088C30.6239 18.9541 30.8744 19.5578 30.875 20.1875V28.5C30.8744 29.1297 30.6239 29.7334 30.1787 30.1787C29.7334 30.6239 29.1297 30.8744 28.5 30.875Z M4.75 23.75V26.125H10.1959L2.375 33.9459L4.05413 35.625L11.875 27.8041V33.25H14.25V23.75H4.75ZM33.25 14.25H26.125C25.4953 14.2494 24.8916 13.9989 24.4463 13.5537C24.0011 13.1084 23.7506 12.5047 23.75 11.875V4.75C23.7506 4.1203 24.0011 3.51658 24.4463 3.07132C24.8916 2.62605 25.4953 2.37563 26.125 2.375H33.25C33.8797 2.37563 34.4834 2.62605 34.9287 3.07132C35.3739 3.51658 35.6244 4.1203 35.625 4.75V11.875C35.6244 12.5047 35.3739 13.1084 34.9287 13.5537C34.4834 13.9989 33.8797 14.2494 33.25 14.25ZM26.125 4.75V11.875H33.25V4.75H26.125Z",
    },
    {
      id: "extend",
      text: "多角度拓展",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--MI-color)" }}>多角度拓展：</span>
          选择工作区中的
          <span style={{ color: "var(--MI-color)" }}>白模图（必选）</span>
          ，拓展多角度的模型图像。
        </span>
      ),
      svgPath:
        "M16.5 28.875H23.7188V30.9375H16.5V28.875ZM16.5 24.75H30.9375V26.8125H16.5V24.75ZM16.5 20.625H30.9375V22.6875H16.5V20.625ZM4.125 20.625V22.6875H8.85431L2.0625 29.4793L3.52069 30.9375L10.3125 24.1457V28.875H12.375V20.625H4.125ZM28.875 8.25H16.5L12.9793 4.72931C12.5926 4.34249 12.0681 4.12512 11.5211 4.125H4.125C3.57799 4.125 3.05339 4.3423 2.66659 4.72909C2.2798 5.11589 2.0625 5.64049 2.0625 6.1875V18.5625H4.125V6.1875H11.5211L15.0418 9.70819L15.6461 10.3125H28.875V18.5625H30.9375V10.3125C30.9375 9.76549 30.7202 9.24089 30.3334 8.85409C29.9466 8.4673 29.422 8.25 28.875 8.25Z",
    },
    {
      id: "transform",
      text: "转化为白模图",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--MI-color)" }}>转化为白模图：</span>
          选择工作区中的
          <span style={{ color: "var(--MI-color)" }}>文本或图片（必选）</span>
          ，生成产品白模图。
        </span>
      ),
      svgPath:
        "M25.4995 35.625L20.1256 30.2495L21.2745 29.0811L24.687 32.4319V26.2812H15.3124C14.5649 26.2812 13.9403 26.031 13.4388 25.5305C12.9383 25.0289 12.688 24.4044 12.688 23.6569V14.2806H4.875V12.6556H12.688V6.56837L9.2755 9.91912L8.125 8.74912L13.5005 3.37524L18.8744 8.75074L17.7255 9.91912L14.313 6.56837V23.6569C14.313 23.906 14.417 24.1352 14.625 24.3442C14.833 24.5522 15.0621 24.6562 15.3124 24.6562H34.125V26.2812H26.312V32.4319L29.7245 29.0811L30.875 30.2511L25.4995 35.625ZM24.687 21.4062V15.28C24.687 15.0308 24.583 14.8022 24.375 14.5942C24.167 14.3852 23.9379 14.2806 23.6876 14.2806H17.5614V12.6556H23.6876C24.4351 12.6556 25.0597 12.9064 25.5612 13.408C26.0617 13.9085 26.312 14.533 26.312 15.2816V21.4079L24.687 21.4062Z",
    },
  ],
  [AIStage.Rendering]: [
    {
      id: "createNew",
      text: "生成全新场景",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--R-color)" }}>生成全新场景：</span>
          根据设计任务，生成新的参考场景图。
        </span>
      ),
      svgPath:
        "M16.5 0C7.38736 0 0 7.38736 0 16.5C0 25.6132 7.38736 33 16.5 33C25.6132 33 33 25.6132 33 16.5C33 7.38736 25.6132 0 16.5 0ZM16.5 30.97C8.53927 30.97 2.0625 24.4607 2.0625 16.4999C2.0625 8.5392 8.53927 2.06244 16.5 2.06244C24.4607 2.06244 30.9375 8.53923 30.9375 16.4999C30.9375 24.4606 24.4607 30.97 16.5 30.97ZM23.7188 15.4688H17.5312V9.28125C17.5312 8.712 17.0693 8.25 16.5 8.25C15.9307 8.25 15.4688 8.712 15.4688 9.28125V15.4688H9.28125C8.712 15.4688 8.25 15.9307 8.25 16.5C8.25 17.0693 8.712 17.5312 9.28125 17.5312H15.4688V23.7188C15.4688 24.288 15.9307 24.75 16.5 24.75C17.0693 24.75 17.5312 24.288 17.5312 23.7188V17.5312H23.7188C24.288 17.5312 24.75 17.0693 24.75 16.5C24.75 15.9307 24.288 15.4688 23.7188 15.4688Z",
    },
    {
      id: "refine",
      text: "现有产品参考",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--R-color)" }}>现有产品参考：</span>
          根据设计任务，生成新的产品渲染图。
        </span>
      ),
      svgPath:
        "M28.5 30.875H19V28.5H28.5V20.1875H9.5C8.8703 20.1869 8.26658 19.9364 7.82132 19.4912C7.37605 19.0459 7.12563 18.4422 7.125 17.8125V9.5C7.12563 8.8703 7.37605 8.26658 7.82132 7.82132C8.26658 7.37605 8.8703 7.12563 9.5 7.125H21.375V9.5H9.5V17.8125H28.5C29.1297 17.8131 29.7334 18.0636 30.1787 18.5088C30.6239 18.9541 30.8744 19.5578 30.875 20.1875V28.5C30.8744 29.1297 30.6239 29.7334 30.1787 30.1787C29.7334 30.6239 29.1297 30.8744 28.5 30.875Z M4.75 23.75V26.125H10.1959L2.375 33.9459L4.05413 35.625L11.875 27.8041V33.25H14.25V23.75H4.75ZM33.25 14.25H26.125C25.4953 14.2494 24.8916 13.9989 24.4463 13.5537C24.0011 13.1084 23.7506 12.5047 23.75 11.875V4.75C23.7506 4.1203 24.0011 3.51658 24.4463 3.07132C24.8916 2.62605 25.4953 2.37563 26.125 2.375H33.25C33.8797 2.37563 34.4834 2.62605 34.9287 3.07132C35.3739 3.51658 35.6244 4.1203 35.625 4.75V11.875C35.6244 12.5047 35.3739 13.1084 34.9287 13.5537C34.4834 13.9989 33.8797 14.2494 33.25 14.25ZM26.125 4.75V11.875H33.25V4.75H26.125Z",
    },
    {
      id: "extend",
      text: "扩展至场景",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--R-color)" }}>扩展至场景：</span>
          选择工作区中的
          <span style={{ color: "var(--R-color)" }}>产品渲染图（必选）</span>
          ，扩展至相关场景中。
        </span>
      ),
      svgPath:
        "M16.5 28.875H23.7188V30.9375H16.5V28.875ZM16.5 24.75H30.9375V26.8125H16.5V24.75ZM16.5 20.625H30.9375V22.6875H16.5V20.625ZM4.125 20.625V22.6875H8.85431L2.0625 29.4793L3.52069 30.9375L10.3125 24.1457V28.875H12.375V20.625H4.125ZM28.875 8.25H16.5L12.9793 4.72931C12.5926 4.34249 12.0681 4.12512 11.5211 4.125H4.125C3.57799 4.125 3.05339 4.3423 2.66659 4.72909C2.2798 5.11589 2.0625 5.64049 2.0625 6.1875V18.5625H4.125V6.1875H11.5211L15.0418 9.70819L15.6461 10.3125H28.875V18.5625H30.9375V10.3125C30.9375 9.76549 30.7202 9.24089 30.3334 8.85409C29.9466 8.4673 29.422 8.25 28.875 8.25Z",
    },
    {
      id: "transform",
      text: "转化为渲染图",
      disabled: false,
      message: (
        <span>
          <span style={{ color: "var(--R-color)" }}>扩展至场景：</span>
          选择工作区中的
          <span style={{ color: "var(--R-color)" }}>草图或模型图（必选）</span>
          ，生成产品的渲染图。
        </span>
      ),
      svgPath:
        "M25.4995 35.625L20.1256 30.2495L21.2745 29.0811L24.687 32.4319V26.2812H15.3124C14.5649 26.2812 13.9403 26.031 13.4388 25.5305C12.9383 25.0289 12.688 24.4044 12.688 23.6569V14.2806H4.875V12.6556H12.688V6.56837L9.2755 9.91912L8.125 8.74912L13.5005 3.37524L18.8744 8.75074L17.7255 9.91912L14.313 6.56837V23.6569C14.313 23.906 14.417 24.1352 14.625 24.3442C14.833 24.5522 15.0621 24.6562 15.3124 24.6562H34.125V26.2812H26.312V32.4319L29.7245 29.0811L30.875 30.2511L25.4995 35.625ZM24.687 21.4062V15.28C24.687 15.0308 24.583 14.8022 24.375 14.5942C24.167 14.3852 23.9379 14.2806 23.6876 14.2806H17.5614V12.6556H23.6876C24.4351 12.6556 25.0597 12.9064 25.5612 13.408C26.0617 13.9085 26.312 14.533 26.312 15.2816V21.4079L24.687 21.4062Z",
    },
  ],
};


// 定义基本的 BackendItem 接口
export interface BackendItem {
  type: "image" | "json";
  timestamp: string;
  data: ImageData | JsonData;
  buttonText?: string; // 添加的字段
  aiStage?: AIStage; // 添加的字段
}

// 定义 ImageData 接口
interface ImageData {
  url: string;
}

// 定义 JsonData 接口
interface JsonData {
  [key: string]: string[] | any; // 允许任意字符串键，值为字符串数组或任意类型
}

export const backendContents: Record<AIStage, BackendItem[]> = {
  [AIStage.DesignBrief]: [],
  [AIStage.Sketch]: [],
  [AIStage.ModelImage]: [],
  [AIStage.Rendering]: [],
};
